[
  {
    "id": 1,
    "text": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"من سلك طريقًا يلتمس فيه علمًا سهل الله له به طريقًا إلى الجنة\"",
    "source": "رواه مسلم"
  },
  {
    "id": 2,
    "text": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى، فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها أو امرأة ينكحها فهجرته إلى ما هاجر إليه\"",
    "source": "متفق عليه"
  },
  {
    "id": 3,
    "text": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"لا يؤمن أحدكم حتى يحب لأخيه ما يحب لنفسه\"",
    "source": "رواه البخاري ومسلم"
  },
  {
    "id": 4,
    "text": "عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"ثلاث من كن فيه وجد حلاوة الإيمان: أن يكون الله ورسوله أحب إليه مما سواهما، وأن يحب المرء لا يحبه إلا لله، وأن يكره أن يعود في الكفر كما يكره أن يلقى في النار\"",
    "source": "رواه البخاري ومسلم"
  },
  {
    "id": 5,
    "text": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"المسلم من سلم المسلمون من لسانه ويده، والمهاجر من هجر ما نهى الله عنه\"",
    "source": "رواه البخاري ومسلم"
  },
  {
    "id": 6,
    "text": "عن عبد الله بن عمرو رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: \"المسلم من سلم المسلمون من لسانه ويده، والمهاجر من هجر ما نهى الله عنه\"",
    "source": "رواه البخاري"
  },
  {
    "id": 7,
    "text": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"من كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليصمت، ومن كان يؤمن بالله واليوم الآخر فليكرم جاره، ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه\"",
    "source": "رواه البخاري ومسلم"
  },
  {
    "id": 8,
    "text": "عن أبي ذر رضي الله عنه قال: قال لي رسول الله صلى الله عليه وسلم: \"اتق الله حيثما كنت، وأتبع السيئة الحسنة تمحها، وخالق الناس بخلق حسن\"",
    "source": "رواه الترمذي وقال: حديث حسن"
  },
  {
    "id": 9,
    "text": "عن ابن عباس رضي الله عنهما قال: كنت خلف النبي صلى الله عليه وسلم يوماً فقال: \"يا غلام، إني أعلمك كلمات: احفظ الله يحفظك، احفظ الله تجده تجاهك، إذا سألت فاسأل الله، وإذا استعنت فاستعن بالله، واعلم أن الأمة لو اجتمعت على أن ينفعوك بشيء لم ينفعوك إلا بشيء قد كتبه الله لك، وإن اجتمعوا على أن يضروك بشيء لم يضروك إلا بشيء قد كتبه الله عليك، رفعت الأقلام وجفت الصحف\"",
    "source": "رواه الترمذي وقال: حديث حسن صحيح"
  },
  {
    "id": 10,
    "text": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"إن الله تعالى قال: من عادى لي وليا فقد آذنته بالحرب، وما تقرب إلي عبدي بشيء أحب إلي مما افترضته عليه، وما يزال عبدي يتقرب إلي بالنوافل حتى أحبه، فإذا أحببته كنت سمعه الذي يسمع به، وبصره الذي يبصر به، ويده التي يبطش بها، ورجله التي يمشي بها، وإن سألني لأعطينه، ولئن استعاذني لأعيذنه\"",
    "source": "رواه البخاري"
  },
  {
    "id": 11,
    "text": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"سبعة يظلهم الله في ظله يوم لا ظل إلا ظله: الإمام العادل، وشاب نشأ في عبادة الله، ورجل قلبه معلق في المساجد، ورجلان تحابا في الله اجتمعا عليه وتفرقا عليه، ورجل دعته امرأة ذات منصب وجمال فقال إني أخاف الله، ورجل تصدق بصدقة فأخفاها حتى لا تعلم شماله ما تنفق يمينه، ورجل ذكر الله خاليا ففاضت عيناه\"",
    "source": "رواه البخاري ومسلم"
  },
  {
    "id": 12,
    "text": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"خير يوم طلعت عليه الشمس يوم الجمعة، فيه خلق آدم، وفيه أدخل الجنة، وفيه أخرج منها، ولا تقوم الساعة إلا في يوم الجمعة\"",
    "source": "رواه مسلم"
  },
  {
    "id": 13,
    "text": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"الصلوات الخمس، والجمعة إلى الجمعة، ورمضان إلى رمضان، مكفرات لما بينهن إذا اجتنبت الكبائر\"",
    "source": "رواه مسلم"
  },
  {
    "id": 14,
    "text": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"من صام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه\"",
    "source": "رواه البخاري ومسلم"
  },
  {
    "id": 15,
    "text": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"من قام ليلة القدر إيمانا واحتسابا غفر له ما تقدم من ذنبه\"",
    "source": "رواه البخاري ومسلم"
  },
  {
    "id": 16,
    "text": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"أفضل الصيام بعد رمضان شهر الله المحرم، وأفضل الصلاة بعد الفريضة صلاة الليل\"",
    "source": "رواه مسلم"
  },
  {
    "id": 17,
    "text": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"من صلى على جنازة حتى يصلى عليها فله قيراط، ومن شهدها حتى تدفن فله قيراطان، قيل: وما القيراطان؟ قال: مثل الجبلين العظيمين\"",
    "source": "رواه البخاري ومسلم"
  },
  {
    "id": 18,
    "text": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"إذا مات الإنسان انقطع عنه عمله إلا من ثلاثة: إلا من صدقة جارية، أو علم ينتفع به، أو ولد صالح يدعو له\"",
    "source": "رواه مسلم"
  },
  {
    "id": 19,
    "text": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"من دعا إلى هدى كان له من الأجر مثل أجور من تبعه لا ينقص ذلك من أجورهم شيئا، ومن دعا إلى ضلالة كان عليه من الإثم مثل آثام من تبعه لا ينقص ذلك من آثامهم شيئا\"",
    "source": "رواه مسلم"
  },
  {
    "id": 20,
    "text": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"من نفس عن مؤمن كربة من كرب الدنيا نفس الله عنه كربة من كرب يوم القيامة، ومن يسر على معسر يسر الله عليه في الدنيا والآخرة، ومن ستر مسلما ستره الله في الدنيا والآخرة، والله في عون العبد ما كان العبد في عون أخيه\"",
    "source": "رواه مسلم"
  }
]
